"""
Щоб виграти головний приз лотереї, необхідний збіг кількох номерів на лотерейному квитку з числами,
що випали випадковим чином і в певному діапазоні під час чергового тиражу. Наприклад,
необхідно вгадати шість чисел від 1 до 49 чи п'ять чисел від 1 до 36 тощо.

Вам необхідно написати функцію get_numbers_ticket(min, max, quantity), яка допоможе генерувати
набір унікальних випадкових чисел для таких лотерей. Вона буде повертати випадковий набір чисел у межах
заданих параметрів, причому всі випадкові числа в наборі повинні бути унікальні.
"""

import random as rnd


def get_numbers_ticket(min, max, quantity):
    if (min < 1) or (max > 1000) or not (min <= quantity <= max):
        return []
    return sorted(rnd.sample(range(min, max + 1), quantity))


tests = [(1, 49, 6), (1, 36, 5), (100, 2, 15), (2, 100, 15), (-1, 5, 2), (1, 10, 20)]

for i, tst in enumerate(tests):
    a, b, c = tst
    print(f"[{i}] {a}, {b}, {c} \t->\t Ваші лотерейні числа: {get_numbers_ticket(a, b,c)}")
